Repository: tjuyou/esim_error_code
Catalog: lib/l10n/intl_*.arb
Languages: es, ru, zh

# app_name
source: eSIM Manager
zh: eSIM管家

# input_alias
source: Please name the device
es: Por favor nombre el dispositivo
ru: Пожалуйста, назовите устройство
zh: 请输入设备别名

source: Save
es: Guardar
ru: Сохранить
zh: 保存

# input_alias_tips
source: Please name the device
es: Por favor nombre el dispositivo
ru: Пожалуйста, назовите устройство
zh: 请填写设备别名

# delete_device
source: Delete
es: Borrar
ru: Удалить
zh: 删除设备

# add_by_wifi
source: After deletion, please add again
es: Por favor, vuelva a agregar después de eliminar
ru: После удаления, добавьте снова
zh: 删除后请重新添加

source: Delete
es: Borrar
ru: Удалить
zh: 删除

# alias
source: Set device ID
es: Establecer ID de dispositivo
ru: Установить ID устройства
zh: 设置别名

# connect_mode
source: Connection mode:{mode}
es: Modo de conexión:{mode}
ru: Режим соединения:{mode}
zh: 连接方式：{mode}

source: Bluetooth
zh: 蓝牙

# wifi
source: WLAN
zh: Wi-Fi

source: Connected
es: Conectado
ru: Соединено
zh: 已连接

source: Disconnected
es: Desconectado
ru: не подключен
zh: 未连接

# unavailable
source: Not available
es: No disponible
ru: Недоступен
zh: 不可用

source: Available
es: Disponible
ru: Доступен
zh: 可用

source: Connecting
es: Conectando
ru: Подключение
zh: 正在连接

# disconnect_net
source: The network is not turned on
es: La red no está encendida
ru: Эта сеть не включена
zh: 未开启网络

# disconnect_content
source: Please turn on the mobile network in system settings.
es: Por favor, encienda la red móvil en la configuración del sistema.
ru: Пожалуйста, включите мобильную сеть в настройках системы.
zh: 系统检测到您的手机未开启移动网络，请前往系统设置开启

source: Open
es: Abierto
ru: Открыть
zh: 去开启

source: Search
es: Búsqueda
ru: Поиск
zh: 搜索

source: Add device
es: Añadir dispositivo
ru: Добавить устройство
zh: 添加设备

source: Package Mall
es: Paquetes
ru: Магазин приложений
zh: 套餐商城

# about_us
source: About
es: Acerca de
ru: О программе
zh: 关于我们

# activate_mode
source: No packages found,please select as followed:
es: No se han encontrado paquetes, seleccione de la siguiente manera:
ru: Пакеты не найдены, пожалуйста, выберите как следует:
zh: 当前设备未下载任何套餐，请通过以下方式下载激活

source: Scan
es: Escanear
ru: Сканировать
zh: 扫一扫

# gallery
source: Choose from Album
es: Elige entre el álbum
ru: Выбрать из альбома
zh: 从相册选择

source: Activation code
es: Código de activación
ru: Код активации
zh: 激活码

# goto_mall
source: Please make a purchase in
es: Por favor haga una compra en Package Mall >>
ru: Пожалуйста, сделайте покупку
zh: 如需购买套餐可前往

# please_input
source: Please enter
es: Por favor escriba
ru: Пожалуйста, введите
zh: 请输入

# search_nothing
source: Device unfound,please check the device and try again.
es: Dispositivo no encontrado, por favor Revisa el dispositivo e intenta de nuevo.
ru: Устройство не найдено, проверьте устройство и попробуйте снова.
zh: 未搜索到设备，请确认设备是否开启

# disabled
source: Not enabled
es: No disponible
ru: Не включено
zh: 未启用

source: Enabled
es: Activado
ru: Включено
zh: 已启用

source: Disable
es: Desactivado
ru: Отключить
zh: 停用

source: Enable
es: Permitir
ru: Включить
zh: 启用

# iccid
source: ICCID:{iccid}
zh: 卡序列号：{iccid}

# download_time
source: Download time:{time}
es: Tiempo de descarga:{time}
ru: Время загрузки:{time}
zh: 下载时间：{time}

# qr_confirm
source: SIM Info Confirm
es: Confirmar Información de SIM
ru: Подтвердить информацию о SIM
zh: 信息确认

# scan_success
source: Scan succeeded
es: Escaneo tuvo éxito
ru: Успешно отсканировано
zh: 扫描成功

# tap_download
source: Click the Activate button to start Profile downloading.
es: Haga clic en el botón Activar para iniciar la descarga del perfil.
ru: Нажмите кнопку "Активировать" для начала загрузки профиля.
zh: 点击激活按钮开始下载号码

source: Activate
es: Activar
ru: Активировать
zh: 激活

# connect_failed
source: Connection failure. Please check and reconnect or restart the device.
es: Fallo de conexión. Por favor, compruebe y vuelva a conectar o reinicie el dispositivo.
ru: Сбой подключения. Пожалуйста, проверьте и подключите заново или перезагрузите устройство.
zh: 连接失败，请检查重新连接或重启设备

# enable_esim
source: Enable SIM card
es: Habilitar la tarjeta SIM
ru: Включение SIM-карты
zh: 启用SIM卡

# enable_tip
source: Please wait for the activation of the package service.
es: Por favor, espere la activación del servicio del paquete.
ru: Пожалуйста, подождите для активации пакета услуг.
zh: 启用后请耐心等待套餐服务的开通

# disable_esim
source: Disable SIM card
es: Deshabilitar la tarjeta SIM
ru: Отключение SIM-карты
zh: 停用sim卡

# disable_tip
source: It's will out of service when this SIM disabled.
es: Está fuera de servicio cuando esta SIM se deshabilitó.
ru: Когда SIM-карта отключена, службы не будут работать.
zh: 停用SIM卡将关闭当前启用的服务

# delete_esim
source: Delete SIM card
es: Eliminar tarjeta SIM
ru: Удалить SIM-карту
zh: 删除SIM卡

# delete_tip
source: Warning:It cannot be regained after deletion.
es: Advertencia: no se puede recuperar después de la eliminación.
ru: Внимание: SIM-карта не может быть восстановлена после удаления.
zh: 删除后将无法恢复，请谨慎操作

# input_esim_name
source: Please name the SIM
es: Por favor nombre la sim
ru: Пожалуйста, назовите SIM-карту
zh: 请输入卡片名称

# empty_device
source: No devices connected yet.
es: No hay dispositivos conectados todavía.
ru: Нет подключенных устройств.
zh: 当前没有连接过任何设备

# connect_type
source: Please select supported connection type:WLAN,Bluetooth
es: Por favor, seleccione Tipo de conexión compatible: WLAN, Bluetooth
ru: Пожалуйста, выберите тип подключения: Wi-Fi либо Bluetooth
zh: 请选择连接方式，目前可用的连接方式：Wi-Fi、蓝牙

# choose_done
source: Done
es: Hecho
ru: Готово
zh: 完成

# empty_list
source: The list is blank.
es: La lista está en blanco.
ru: Список пустой
zh: 列表为空

# qr_null
source: No available QR codes found
es: No se han encontrado códigos QR disponibles
ru: QR-код не найден
zh: 未发现可用二维码

# qr_unavailable
source: QR code is not available. Please try again
es: El código QR no está disponible. Inténtalo de nuevo
ru: QR-код недоступен. Пожалуйста, попробуйте снова.
zh: 二维码不可用请再次尝试

# please_input_activation_code
source: Please fill in the activation code
es: Por favor, complete el código de activación
ru: Пожалуйста, введите код активации
zh: 请填写激活码

# permission_denied
source: Permission is prohibited
es: El permiso está prohibido
ru: Нет разрешения
zh: 权限被禁止

# scan_qr
source: Please aim the scan box at the QR code sent by the mall
es: Por favor, apunte al cuadro de escaneo en el código QR enviado por el centro comercial
ru: Пожалуйста, отсканируйте QR-код eSIM
zh: 请将扫描框对准商城发送的二维码

# choose
source: Option
es: Opción
ru: Параметры
zh: 选择

# operate_failed
source: Operation failed
es: Operación fallida
ru: Действие не удалось
zh: 操作失败

# activate_failed
source: Activation failed. Please try again or contact the card supplier
es: Activación fallida. Por favor, inténtalo de nuevo o póngase en contacto con el proveedor de la tarjeta
ru: Активация не удалась. Пожалуйста, попробуйте еще раз или обратитесь к Вашему оператору
zh: 激活失败，请再次尝试或联系卡片供应商

# downloading
source: Please wait patiently during verification
es: Por favor, espere pacientemente durante la verificación
ru: Пожалуйста, подождите, идет проверка
zh: 验证中，请耐心等待

# version
source: Version:{version}
es: Versión:{version}
ru: Версия:{version}
zh: 版本：{version}

# corporation_name
source: Shenzhen Links Field Internet of things Technology Co., Ltd
zh: 深圳市领科物联网科技有限公司

# copyright_content
source: This application is a part of the Linksfield eSIM solution. It can facilitate the user to manage the eSIM equipment without operationinterface and support the WLAN、Bluetooth and other equipment connection modes. It enables the device to activate the eSIM card and download the number, and can delete the number and other operations.
es: Esta aplicación es parte de la solución Linksfield ESIM. Puede facilitar al usuario que administre los equipos ESIM sin OperatingInterface y admiten los modos de conexión WLAN, Bluetooth y otros equipos. Permite que el dispositivo active la tarjeta ESIM y descargue el número y puede eliminar el número y otras operaciones.
ru: Это приложение является собственностью компании Linksfield. Оно помогает пользователю управлять E-SIM оборудованием через WLAN либо Bluetooth подключения. Оно помогает устройству активировать SIM-карту, может удалить SIM-карту и производит другие операции.
zh: This application is a part of the Linksfield eSIM solution. It can facilitate the user to manage the eSIM equipment without operationinterface and support the Wi-Fi、Bluetooth and other equipment connection modes. It enables the device to activate the eSIM card and download the number,and can delete the number and other operations.

# device_detail
source: Device Info.
es: Información
ru: Информация об устройстве
zh: 设备详情

# network_error
source: When your device or mobile phone cannot operate with the network
es: Cuando su dispositivo o teléfono móvil no puede funcionar con la red
ru: Когда устройство или мобильный телефон не может работать с сетью.
zh: 当您的设备或手机无法使用网络进行操作时

# network_tips
source: ###### Solution 1. If you have problems using the device's mobile network, you can try restarting the device or reconnecting the device 2. If you are managing the device QRcode + If the phone pops up options: "continue to use the wireless network", "use the mobile network but keep the wireless network connected" Click "use mobile network but keep wireless network connection" to continue to complete the operation + If you select "continue to use wireless network" when prompted Or if the system prompt does not pop up, you can try to reconnect the device to the wireless network and trigger the system prompt again; + If you still can't use the network after trying to reconnect the device, you can check whether the device supports the Bluetooth function, connect the device to the app using the Bluetooth connection method, and finally complete the management of the device QRcode; + If you try all the above schemes, you can't complete the QRcode management Please follow the following steps for the management of the device: ① enter the details page of mobile phone WLAN network connection; ② record the IP configuration of the current WLAN network connection; ③ set the device WLAN network IP configuration to "manual" ; ④ fill in the IP configuration recorded in step ② in the IP configuration; ⑤ return to the app to complete the QRcode operation; ⑥ after confirming that the device QRcode has been "activated", change the device WLAN network connection IP configuration back to "automatic".
es: ###### SOLUCIÓN 1. Si tiene problemas para usar la red móvil del dispositivo, puede intentar reiniciar el dispositivo o volver a conectar el dispositivo 2. Si está administrando el dispositivo QRCODE + Si el teléfono aparece opciones: "Continúe usando la red inalámbrica", "Use la red móvil, pero mantenga la red inalámbrica conectada" Haga clic en "Usar red móvil pero mantenga la conexión de red inalámbrica" para continuar completando la operación + Si selecciona "Continuar utilizando la red inalámbrica" ​​cuando se le solicita o si el mensaje del sistema no se incluye, puede intentar volver a conectar el dispositivo a la red inalámbrica y volver a activar el indicador del sistema; + Si aún no puede usar la red después de intentar volver a conectar el dispositivo, puede verificar si el dispositivo admite la función Bluetooth, conecte el dispositivo a la aplicación con el método de conexión Bluetooth y finalmente complete la administración de la dispositivo QRCODE; + Si intenta todos los esquemas anteriores, no puede completar la administración QRCODE, siga los siguientes pasos para la administración del dispositivo: ① Ingrese la página de detalles de la conexión de red WLAN de teléfono móvil; ② Registre la configuración de IP de la conexión de red WLAN actual; ③ Establezca el dispositivo WLAN Network IP Configuración a "Manual"; ④ Rellene la configuración de IP registrada en el paso ② en la configuración de IP; ⑤ Regresar a la aplicación para completar la operación QRCode; ⑥ Después de confirmar que el dispositivo QRCODE se ha "activado", cambie la configuración de IP de conexión de red de dispositivos WLAN Volver a "Automático".
ru: ###### Решение \n1. Если у вас возникли проблемы с использованием мобильной сети оператора, перезагрузите часы или повторно подключите к сети \n2. Отсканируйте QR-код и нажмите \"использовать мобильную сеть и сохранить подключение к беспроводной сети" \n + Если вы выберете "продолжать использовать беспроводную сеть" или если системное приглашение не появится, вы можете попробовать повторно подключить устройство к беспроводной сети и снова вызвать системное приглашение; \n + Если вы по-прежнему не можете подключиться к сети после попытки повторного подключения устройства, проверьте Bluetooth-соединение и подключите часы к приложению используя Bluetooth;\n + Если все вышеперечисленное не помогло, проверьте соединение Wi-Fi и Bluetooth в телефоне повторно. Проделайте все шаги еще раз.
zh: ###### 解决方案 1. 若您在使用设备的移动网络时出现问题，可以尝试重启设备或重新连接设备 2. 若您在管理设备QRcode时 + 若手机弹出选项：“继续使用无线网络”、 “使用手机网络但保持无线网络连接”，可点击使用手机网络但保持无线网络连接”继续完成操作； + 若您在系统提示时选择了“继续使用无线网络“”或没有弹出系统提示，可以尝试重新连接设备无线网络，再 次触发系统提示； + 若您尝试重新连接设备后仍无法使用网络，可检查设备是否支持蓝牙功能，使用蓝牙连接方式将设备接入App，最后完成设备QRcode的管理操作； + 若您尝试了上述所有方案均无法完成对QRcode的管理操作，请按照以下步骤操作： ① 进入手机WLAN网络连接的详情页面; ② 记录当前WLAN网络连接的IP配置; ③ 将设备WLAN网络IP配置设置为“手动”; ④ 在IP配置填写步骤②记录的IP配置; ⑤ 回到App完成QRcode操作; ⑥ 确认设备QRcode已“激活”后，将设备WLAN网络连接IP配置改回 “自动”。

# btn_skip
source: Skip
es: Saltar
ru: Пропустить
zh: 跳过

# text_welcome
source: Welcome to eSIM Manager!
es: Bienvenido a eSIM Manager!
ru: Добро пожаловать в eSIM Manager!
zh: 欢迎使用eSIM管家！

# text_begin_connect
source: Click to start connecting the first device
es: ¡Empieza a conectar tu primer dispositivo!
ru: Нажмите, чтобы начать подключение первого устройства
zh: 点击开始连接第一个设备

# warning_skip_title
source: Add later?
es: Añadir más tarde?
ru: Добавить позже?
zh: 稍后添加设备？

# warning_skip_content
source: You cannot use the device properly until you add it
es: No puede usar el dispositivo correctamente hasta que lo agregue
ru: Вы не сможете правильно использовать устройство, пока вы не добавите его
zh: 您在添加设备前无法正常使用设备

# btn_cancel
source: Cancel
es: Cancelar
ru: Отменить
zh: 取消

# btn_connect_device
source: Connect Device
es: Conectar dispositivo
ru: Подключить устройство
zh: 连接设备

# text_select_device_type
source: Please select the device model
es: Seleccione el modelo de dispositivo
ru: Выберите модель устройства
zh: 请选择设备型号

# text_select_connect
source: Select connection type
es: Seleccione Tipo de Conexión
ru: Выберите тип подключения
zh: 选择连接方式

# text_connect_support
source: Supported connection type:WLAN,Bluetooth
es: Tipo de conexión soportado: WLAN, Bluetooth
ru: Поддерживаемые типы подключения: WLAN, Bluetooth
zh: 目前支持的两种连接方式：蓝牙、Wi-Fi

# btn_connect_ble
source: Bluetooth connectivity
es: Conectividad Bluetooth
ru: Соединение Bluetooth
zh: 蓝牙连接

# btn_connect_wifi
source: WLAN connection
es: Conexión wlan
ru: Соединение WLAN
zh: Wi-Fi连接

# text_divider
source: ---------- or ----------
es: ---------- o ----------
ru: ---------- или ----------
zh: ---------- 或 ----------

# text_search
source: Search
es: Búsqueda
ru: Поиск
zh: 搜索

# warning_ble_not_open_title
source: Bluetooth off
es: Bluetooth apagado
ru: Bluetooth выкл
zh: 蓝牙未开启

# warning_ble_not_open_content
source: Please go to system settings to enable Bluetooth
es: Por favor, vaya a la configuración del sistema para habilitar Bluetooth
ru: Пожалуйста, перейдите в настройки системы, чтобы включить Bluetooth
zh: 请前往系统设置开启蓝牙功能

# btn_set
source: Settings
es: Ajustes
ru: Настройки
zh: 设置

# text_select_device
source: Select device
es: Seleccione el dispositivo
ru: Выбрать устройство
zh: 选择设备

# btn_add_device
source: Add device
es: Añadir dispositivo
ru: Добавить устройство
zh: 添加设备

# btn_goto_set
source: Go to Settings >>
es: Ir a la configuración >>
ru: Перейдите в раздел Настройки >>
zh: 前往设置>>

# text_ble_not_open
source: The system recognizes that you have not turned on the Bluetooth function of your mobile phone
es: El sistema reconoce que no ha encendido la función Bluetooth de su teléfono móvil
ru: Система обнаружила, что вы не включили функцию Bluetooth вашего мобильного телефона
zh: 系统识别到您未开启手机蓝牙功能

# text_wifi_not_open
source: The system recognizes that you have not enabled the WLAN function of your mobile phone
es: El sistema reconoce que no ha habilitado la función WLAN de su teléfono móvil
ru: Система обнаружила, что вы не включили функцию WLAN вашего мобильного телефона
zh: 系统识别到您未开启手机WLAN功能

# text_not_find_device
source: No available devices were found
es: No se encontraron dispositivos disponibles.
ru: Не найдено доступных устройств
zh: 没有搜索到可用的设备

# text_wifi_use_wifi
source: Connect devices with WLAN
es: Conectar dispositivos con WLAN
ru: Подключение устройств по WLAN
zh: 使用WI-FI连接设备

# text_wifi_set
source: Please click the connect device button to enter the system settings
es: Haga clic en el botón Conectar dispositivo para ingresar la configuración del sistema
ru: Пожалуйста, нажмите на кнопку подключения устройств для входа в настройки системы
zh: 请点击连接设备按钮，进入系统设置

# text_wifi_use_wlan
source: Connect devices via WLAN
es: Conectar dispositivos a través de WLAN
ru: Подключение устройств по WLAN
zh: 通过WLAN功能连接设备

# btn_wifi_set
source: No device connected, go to settings
es: No hay dispositivo conectado, vaya a la configuración
ru: Устройство не подключено, зайдите в настройки
zh: 未连接设备，前往设置

# btn_wifi_next
source: Device connected,next
es: Dispositivo conectado, Siguiente
ru: Устройство подключено, далее
zh: 已连接设备，下一步

# warning_location_not_open_title
source: Positioning off
es: Posición no activada
ru: Позиционирование выкл
zh: 定位未开启

# warning_location_not_open_content
source: Please go to the system settings to enable the positioning function
es: Por favor, vaya a la configuración del sistema para habilitar la función de posicionamiento
ru: Пожалуйста, перейдите в системные настройки, чтобы включить функцию позиционирования
zh: 请前往系统设置开启定位功能

# text_device_use_explain
source: Device instructions
es: Instrucciones del dispositivo
ru: Инструкции устройства
zh: 设备使用说明

# btn_previous_step
source: Previous step
es: Paso anterior
ru: Предыдущий шаг
zh: 上一步

# btn_next_step
source: Next step
es: Próximo paso
ru: Следующий шаг
zh: 下一步

# btn_start_add_device
source: Start adding device
es: Empezar a agregar dispositivo
ru: Начните добавлять устройства
zh: 开始添加设备

# tips_title
source: Notice:
es: Aviso:
ru: Обратите внимание:
zh: 温馨提示：

# tips_1
source: 1. Please ensure the network is available.
es: 1. Asegúrese de que la red esté disponible.
ru: 1. Пожалуйста, убедитесь, что сеть доступна.
zh: 1.操作前请保证当前网络可用

# tips_2
source: 2. If failure, please click here
es: 2. Si falla, por favor haga clic aquí
ru: 2. В случае ошибки, пожалуйста, нажмите здесь
zh: 2.若操作无法成功请点击

# operate_tips
source: Notice: Please ensure the network is available. If failure, please click here
es: Aviso: Asegúrese de que la red esté disponible. Si falla, por favor haga clic aquí
ru: Примечание: пожалуйста, убедитесь, что сеть доступна. В случае ошибки, пожалуйста, нажмите здесь
zh: 温馨提示：操作前请保证当前网络可用，若无法成功请点击

source: Help
es: Ayuda
ru: Помощь
zh: 帮助

# input_name
source: Please name the SIM
es: Por favor nombre la sim
ru: Пожалуйста, назовите SIM-карту
zh: 请填写卡片名称

# text_connect_support_bluetooth
source: Supported connection type:Bluetooth
es: Tipo de conexión soportado: Bluetooth
ru: Поддерживаемый тип подключения: Bluetooth
zh: 目前支持的连接方式：蓝牙

# text_connect_support_wifi
source: Supported connection type:WLAN
es: Tipo de conexión soportado: WLAN
ru: Поддерживаемый тип подключения: WLAN
zh: 目前支持的连接方式：Wi-Fi

# text_connect_support_none
source: No supported connection type
es: No hay conexión soportada
ru: Неподдерживаемый тип подключения
zh: 目前没有支持的连接方式

# text_upgrade_title
source: Upgrade
es: Actualizar
ru: Обновить
zh: 升级

# text_upgrade_content
source: The app has a new version, now go upgrade
es: La aplicación tiene una nueva versión, ahora ve a actualizar
ru: Обнаружена новая версия приложения, необходимо обновить
zh: 应用有新版本，现在去升级

# btn_ok
source: OK
es: Bien
zh: 好的

# tip_reboot
source: Successful, please restart the device
es: éxito, reinicie el dispositivo
ru: Успешно, перезагрузите устройство
zh: 操作成功，请重启设备

source: Reset
ru: Перезагрузить
zh: 重置

source: Reset device
es: Dispositivo de reinicio
ru: Сброс устройства
zh: 重置设备

# reset_notice
source: Network is unavailable，please reset the device and use the default network before operation Notice: 1. Resetting the device will not affect the currently downloaded eSIM 2. After reset, you need to wait for the default network access before operation 3. Please operate after the device signal light shows "available"
es: La red no está disponible. Reinicie el dispositivo y use la red predeterminada antes de proceder Nota: 1. Reiniciar el dispositivo no afecta a la descarga actual de Esim 2. Después de reiniciar, debe esperar el acceso predeterminado a la red antes de operar 3. Por favor, opere después de que el semáforo del dispositivo muestre "disponible"
ru: Сеть недоступна, пожалуйста, перезагрузите устройство и используйте сеть по умолчанию перед началом процедуры Обратите внимание: 1. Перезагрузка устройства никак не повлияет на установленную E-SIM 2. После перезагрузки, вы должны дождаться доступа к сети перед началом процедуры 3. Начните после того, как устройство покажет что оно "доступно"
zh: 检测到您当前的网络不可用，建议重置设备后使用默认网络完成操作 温馨提示： 1. 重置设备不会影响当前已下载的eSIM 2. 重置后需要等待默认网络入网再进行操作 3. 请在设备信号灯展示“可用”后再进行操作

# reset_confirm
source: You are about to reset the current device: 1. Resetting the device will not affect the currently downloaded eSIM 2. After reset, you need to wait for the default network access before operation 3. Please operate after the device signal light shows "available"
es: Está a punto de reiniciar el dispositivo actual: 1. Reiniciar el dispositivo no afecta a la descarga actual de Esim 2. Después de reiniciar, debe esperar el acceso predeterminado a la red antes de operar 3. Por favor, opere después de que el semáforo del dispositivo muestre "disponible"
ru: Вы собираетесь перезагрузить текущее устройство: 1. Перезагрузка устройства никак не повлияет на установленную E-SIM 2. После перезагрузки, вы должны дождаться доступа к сети перед началом процедуры 3. Начните после того, как устройство покажет что оно "доступно"
zh: 您即将对当前设备执行重置操作： 1. 重置设备不会影响当前已下载的eSIM 2. 重置后需要等待默认网络入网再进行操作 3. 请在设备信号灯展示“可用”后再进行操作

# resetting
source: Resetting, please wait patiently
es: Reiniciando, por favor espere pacientemente
ru: Перезагрузка, пожалуйста подождите
zh: 正在重置，请耐心等待

# network_unavailable
source: Network is unavailable，please check
es: La red no está disponible.
ru: Сеть недоступна, пожалуйста, проверьте
zh: 请检查手机本地网络配置

# device_unavailable
source: Device is unavailable,please check
es: El dispositivo no está disponible.
ru: Устройство недоступно, пожалуйста, проверьте
zh: 请检查您的设备连接状态

# bootstrap_enabled
source: The default network is enabled,please wait for the network access
es: La red predeterminada está habilitada, por favor espere el acceso a la red
ru: Обнаружена сеть по умолчанию, пожалуйста, подождите для доступа к сети
zh: 默认网络已启用，请等待设备入网

# bootstrap_available
source: The default network is enabled
es: La red predeterminada está habilitada
ru: Сеть по умолчанию включена
zh: 默认网络已启用

# rename_illegal
source: The name cannot be used
es: No se puede usar este nombre
ru: Имя не может быть использовано
zh: 名称不可用

# device_disconnected
source: Device has been disconnected,please reconnect
es: El dispositivo está desconectado,por favor,reconectar
ru: Устройство было отключено, подключите его повторно
zh: 设备连接已断开，请重新连接

# universal
source: General Device
es: El mecanismo General
ru: Общее Устройство
zh: 通用设备

# error_title
source: Scan failure
es: Fallo de la exploración
ru: Ошибка сканирования
zh: 扫描失败
