Repository: tjuyou/esim_error_code
Catalog: lib/l10n/intl_*.arb
Languages: es, ru, zh

# downloadable_qr
source: Code to be activated
es: Código a activar
ru: Активировать код
zh: 待激活码号

# downloadable_tips
source: This list shows you want to activate the number, click to download.
es: Esta lista le muestra los números a activar, haga clic para descargar.
ru: Список показывает, что Вы хотите активировать номер, нажмите кнопку Скачать.
zh: 此列表展示您待激活号码，点击进行下载。

# card_name
source: Card name：{carrier}
es: Nombre del perfil：{carrier}
ru: Имя карты: {carrier}
zh: 卡名称：{carrier}

# not_downloaded
source: Not downloaded SIM
es: SIM no descargado
ru: SIM не загружена
zh: 未下载SIM

# confirm_acti_success_title
source: {carrier} is active
es: {carrier} está activo
ru: eSIM {carrier} активирована
zh: {carrier}已激活

# confirm_acti_success_sub_title_no_phone
source: Your number should be ready to use
es: Ya deberías poder utilizar el número
ru: Ваш номер готов к использованию. Перезагрузите устройство.
zh: 您的号码现可使用

# result_download_title
source: Use {carrier}?
es: ¿Usar {carrier}?
ru: Использовать eSIM {carrier}?
zh: 要使用“{carrier}”吗？

# user_consent_switch_no_name_title
source: Use new SIM?
es: ¿Usar una SIM nueva?
ru: Использовать новую SIM?
zh: 要使用新 SIM 卡吗？

# q_result_download_metadata_text
source: 1 {carrier} number is available for this device. {carrier} may begin charging for the service once you have activated it.
es: Hay 1 número de {carrier} disponible para este dispositivo. {carrier} puede empezar a cobrarte por el servicio cuando lo actives.
ru: Один номер {carrier} доступен для этого устройства. После активации оператор {carrier} может начать взимать плату за услуги.
zh: 有 1 个{carrier}号码可供此设备使用。启用服务后，{carrier}可能会开始收取相关费用。

# body_issue_with_sim_profile_no_name
source: There's an issue with your SIM profile. To fix the issue, contact your operator.
es: Hay un problema con tu perfil de SIM. Para solucionarlo, ponte en contacto con tu operador.
ru: Возникла проблема с SIM-профиля. Чтобы исправить проблему, обратитесь к вашему оператору.
zh: 您的 SIM 卡个人资料存在问题。如需解决此问题，请与运营商联系。

# title_incorrect_qr_code
source: Incorrect QR code
es: Código QR incorrecto
ru: Неправильный QR-код
zh: 二维码不正确

# body_check_qr_code_or_go_back
source: Check that you are scanning the correct QR code. To try scanning again, go back to the previous screen.
es: Comprueba que el código QR que has escaneado sea el correcto. Para escanearlo de nuevo, vuelve a la pantalla anterior.
ru: Убедитесь, что вы сканируете правильный QR-код. Чтобы повторить попытку сканирования, вернитесь к предыдущему шагу.
zh: 请确保您扫描的二维码正确无误。如需尝试重新扫描，请返回上一个屏幕。

# detail_contact_carrier_for_more_help
source: For more help, contact your operator.
es: Para obtener más ayuda, ponte en contacto con tu operador.
ru: Для получения справки, обратитесь к вашему оператору.
zh: 如需更多帮助，请与运营商联系。

# title_connect_to_wifi
source: Connect to wifi
es: Conéctate a una red Wi‑Fi
ru: Подключиться к Wi-Fi
zh: 连接到 WLAN

# body_need_wifi_connection
source: You will need a Wi-Fi connection to download a SIM profile.
es: Necesitas tener conexión a una red Wi‑Fi para descargar un perfil de SIM.
ru: Вам понадобится Wi-Fi-соединение для загрузки SIM-карты профиля.
zh: 您需要连接到 WLAN 网络，才能下载 SIM 卡个人资料。

# detail_try_adding_again
source: Once you connect, try adding a mobile network again.
es: Una vez que te hayas conectado, prueba a añadir una red móvil de nuevo.
ru: После подключения, попробуйте добавить мобильную сеть снова.
zh: 连接到网络后，请尝试重新添加移动网络。

# body_not_enough_space_to_download
source: There isn't enough space to download this SIM profile.
es: No hay suficiente espacio para descargar este perfil de SIM.
ru: Недостаточно памяти, чтобы скачать SIM профиль.
zh: 空间不足，无法下载此 SIM 卡个人资料。

# body_make_sure_not_already_downloaded
source: Make sure that the selected SIM profile hasn’t been downloaded on this device or another device. For more help, contact {carrier} at {tel}
es: Comprueba que el perfil de SIM seleccionado no se haya descargado ya en este dispositivo o en otro. Para obtener más ayuda, ponte en contacto con {carrier} llamando al {tel}.
ru: Убедитесь, что выбранный сим профиль еще не загружено на этом устройстве или другом устройстве. Для получения дополнительной помощи, свяжитесь с {carrier} по {tel}
zh: 请确保所选 SIM 卡个人资料尚未下载到此设备或其他设备上。 如需更多帮助，请拨打 {tel} 与{carrier}联系

# body_make_sure_not_already_downloaded_no_tel
source: Make sure that the selected SIM profile hasn’t been downloaded on this device or another device. For more help, contact {carrier}
es: Comprueba que el perfil de SIM seleccionado no se haya descargado ya en este dispositivo o en otro. Para obtener más ayuda, ponte en contacto con {carrier}.
ru: Убедитесь, что выбранный сим профиль еще не загружено на этом устройстве или другом устройстве. Для получения дополнительной помощи, свяжитесь с {carrier}
zh: 请确保所选 SIM 卡个人资料尚未下载到此设备或其他设备上。 如需更多帮助，请与{carrier}联系

# body_device_is_locked
source: Your device is locked by {carrier}.
es: {carrier} ha bloqueado tu dispositivo.
ru: Ваше устройство заблокировано {перевозчик}.
zh: 您的设备已被{carrier}锁定。

# body_device_is_locked_no_name
source: Your device is locked.
es: Tu dispositivo está bloqueado.
ru: Ваше устройство заблокировано.
zh: 您的设备已锁定。

# detail_contact_carrier_to_unlock
source: Contact {carrier} at {tel} to see if the device can be unlocked.
es: Para ver si el dispositivo se puede desbloquear, ponte en contacto con {carrier} llamando al {tel}.
ru: Свяжитесь с {carrier} по {tel}, чтобы узнать, может ли устройство быть разблокировано.
zh: 请拨打 {tel} 与{carrier}联系，确定设备能否解锁。

# detail_contact_carrier_to_unlock_no_name
source: Contact your operator to see if the device can be unlocked.
es: Para ver si el dispositivo se puede desbloquear, ponte en contacto con tu operador.
ru: Свяжитесь с Вашим оператором, чтобы узнать, может ли устройство быть разблокировано.
zh: 请与运营商联系，确定设备能否解锁。

# detail_contact_carrier_to_unlock_no_tel
source: Contact {carrier} to see if the device can be unlocked.
es: Para ver si el dispositivo se puede desbloquear, ponte en contacto con {carrier}.
ru: Свяжитесь с {carrier}, чтобы узнать, может ли устройство быть разблокировано.
zh: 请与{carrier}联系，确定设备能否解锁。

# detail_delete_a_profile_before_retrying
source: Delete a profile in Settings, then try again.
es: Elimina un perfil en Ajustes y vuelve a intentarlo.
ru: Удалите профиль в настройках, затем попробуйте снова.
zh: 请在“设置”中删除个人资料，然后重试。

# title_couldnt_activate_carrier
source: Couldn't activate {carrier}
es: No se ha podido activar {carrier}
ru: Невозможно активировать {carrier}
zh: 无法启用{carrier}

# title_couldnt_activate_carrier_no_name
source: Couldn't activate service
es: No se ha podido activar el servicio
ru: Невозможно активировать услуги
zh: 无法启用服务

# body_something_went_wrong
source: Something went wrong while trying to activate your number.
es: No se ha podido activar tu número.
ru: Что-то пошло не так при попытке активировать Ваш номер.
zh: 尝试激活您的号码时出了点问题。

# title_network_not_activated
source: Network not activated
es: Red no activada
ru: Сеть не активирована
zh: 尚未启用网络

# detail_may_need_eid_number
source: You may need the {eid} for this device.
es: Es posible que necesites el {eid} de este dispositivo.
ru: Вам может понадобиться {eid} для этого устройства.
zh: 您可能需要此设备的 {eid}。

# body_issue_with_sim_profile
source: There’s an issue with your SIM profile. To fix the issue, contact {carrier} at {tel}.
es: Hay un problema con tu perfil de SIM. Para solucionarlo, ponte en contacto con {carrier} llamando al {tel}.
ru: Возникла проблема с Вашим SIM-профилем. Чтобы исправить проблему, свяжитесь {carrier} по {tel}.
zh: 您的 SIM 卡个人资料存在问题。如需解决此问题，请拨打 {tel} 与{carrier}联系。

# body_issue_with_sim_profile_no_tel
source: There's an issue with your SIM profile. To fix the issue, contact {carrier}.
es: Hay un problema con tu perfil de SIM. Para solucionarlo, ponte en contacto con {carrier}.
ru: Возникла проблема с Вашим SIM-профилем. Чтобы исправить проблему, свяжитесь {carrier}.
zh: 您的 SIM 卡个人资料存在问题。如需解决此问题，请与{carrier}联系。

# operation_code_text
source: Operation code
es: Código de operación
ru: Код операции
zh: 操作代码

# error_code_text
source: Error code
es: Código de error
ru: Код ошибки
zh: 错误代码

# detail_provide_info_to_carrier
source: You can provide the following information to your operator: {operateCode} {euiccResult}
es: Puedes proporcionar esta información a tu operador: {operateCode} {euiccResult}
ru: Вы можете предоставить следующую информацию для вашего оператора: {operateCode} {euiccResult}
zh: 您可以向运营商提供以下信息： {operateCode} {euiccResult}

# detail_provide_info_to_carrier1
source: You can provide the following information to your operator:
es: Puedes proporcionar esta información a tu operador:
ru: Вы можете предоставить следующую информацию для вашего оператора:
zh: 您可以向运营商提供以下信息：

# title_profile_already_downloaded
source: Profile already downloaded
es: El perfil ya se ha descargado
ru: Профиль уже скачали
zh: 已下载过个人资料

# title_no_connection
source: No connection
es: No hay conexión
ru: Нет связи
zh: 无网络连接

# body_need_wifi_or_mobile_connection
source: You will need a Wi-Fi or mobile connection to download a SIM profile.
es: Necesitas tener conexión a una red Wi‑Fi o móvil para descargar un perfil de SIM.
ru: Вам понадобится Wi-Fi или мобильный интернет для загрузки SIM-карты профиля.
zh: 您需要连接到 WLAN 网络或移动网络，才能下载 SIM 卡个人资料。

# subject_code_text
source: Subject code
es: Código de asunto
ru: Код субъекта
zh: 主题代码

# reason_code_text
source: Reason code
es: Código de motivo
ru: Код причины
zh: 原因代码

# get_default_sub_title
source: Checking network info…
es: Comprobación de la información de la red…
ru: Проверка сети…
zh: 正在检查网络信息…

# q_download_sub_text
source: This may take a few minutes
es: Esto puede tomar algunos minutos
ru: Это может занять несколько минут
zh: 这可能需要几分钟的时间

# q_download_sub_title
source: Activating {carrier}…
es: La activación {carrier}…
ru: Активация eSIM {carrier}...
zh: 正在激活{carrier}…

# body_make_sure_not_already_downloaded_no_name
source: Make sure that the selected SIM profile hasn’t been downloaded on this device or another device. For more help, contact your operator.
es: Asegúrese de que el perfil SIM seleccionado no se haya descargado en este dispositivo o en otro. para obtener más ayuda, póngase en contacto con su operador.
ru: Убедитесь, что выбранный SIM профиль еще не загружен на этом устройстве или другом устройстве. Для получения дополнительной помощи, обратитесь к вашему оператору.
zh: 请确保所选 SIM 卡个人资料尚未下载到此设备或其他设备上。 如需更多帮助，请与运营商联系。

source: Profile List
es: Lista de perfil
ru: Список профилей
zh: Profile 列表

source: Profile Detail
es: Detalle del perfil
ru: Детали профиля
zh: Profile 详情

source: Device Name
es: Nombre del dispositivo
ru: Имя устройства
zh: 设备名称

# config_device_network
source: Set up device network
es: Equipado con red de equipos
ru: Настройка сети
zh: 配备设备网络

# device_type
source: Device Model
es: Categorías de equipos
ru: Модель устройства
zh: 设备类别

# device_company
source: Device Vendor
es: Fabricantes de equipos
ru: Производитель устройства
zh: 设备厂商

source: External portal
es: El portal externo
ru: Внешний портал
zh: 外部portal

# profile_active
source: Active
es: activo
ru: Активирован
zh: 已激活

# profile_inactive
source: Inactive
es: inactivo
ru: Деактивирован
zh: 未激活

source: Downloaded SIM
es: Descargar la sim
ru: Скачанные SIM
zh: 下载的 SIM卡

source: roaming
es: autostopista
ru: Роуминг
zh: 漫游

source: data
es: datos
ru: Данные
zh: 数据

source: APN name
es: Nombre de usuario
ru: APN имя
zh: 用户名

# apn_password
source: Password
es: La contraseña
ru: Пароль
zh: 密码

source: Password
es: La contraseña
ru: Пароль
zh: 密码

source: APN Setting
es: Configuración de APN
ru: Настройки APN
zh: APN设置

source: Confirm
es: confirmación
ru: Подтвердить
zh: 确认

# input_s
source: Please input {content}
es: Por favor, introduzca {content}
ru: Пожалуйста введите {content}
zh: 请输入{content}

source: Save failed
es: Fallo de salvamento
ru: Сохранение не удалось
zh: 保存失败

# connect_wifi_failed
source: Connection failure.
es: Fallo de conexión.
ru: Сбой подключения.
zh: 连接失败

# wifi_list_title
source: The current data connection is not available
es: La conexión de datos actual no está disponible
ru: Текущее подключение данных недоступно
zh: 当前数据连接不可用

source: Profile Name
es: Nombre del perfil
ru: Имя профиля
zh: 卡名称

# device_network_error
source: The current device is not connected to the network.
es: No hay conexión a internet en el dispositivo actual.
ru: Текущее устройство не подключено к сети.
zh: 当前设备无网络连接

source: Wi-Fi name
es: Nombre de wi-fi
ru: имя Wi-Fi
zh: Wi-Fi名称

# checkWifiInfo
source: Go to Settings to view your Wi-Fi information
es: Vaya a ajustes para ver la información de wi-fi
ru: Перейдите в настройки, чтобы посмотреть информацию о Wi-Fi
zh: 前往设置，查看Wi-Fi信息

# ip_address
source: Device IP Address
es: Dirección IP del dispositivo
ru: IP-адрес устройства
zh: 设备IP地址

source: Port
es: Puerto
ru: Порт
zh: 端口

source: {content} is copied!
es: {content} copiado
ru: {content} скопирован!
zh: {content} 已复制

# confirmation_code_title
source: confirmation code
es: Código de confirmación
ru: код подтверждения
zh: 确认码

# policy_rule_text
source: Needs your consent to allow profile policy rules. This step is required by your carrier.
es: Necesita su consentimiento para permitir las reglas de la política de perfil. Este paso es requerido por su transportista.
ru: Нужно ваше согласие, чтобы согласиться с правилами политики профиля. Этот шаг является обязательным для Вашего оператора.
zh: 需要您的同意才能允许配置文件策略规则。这是您的运营商要求的步骤。

# confirmation_code_text
source: Enter the confirmation code that your carrier gave you. This step is required by your carrier.
es: Introduce el código de confirmación que te ha proporcionado tu operador. Este paso es obligatorio.
ru: Введите код подтверждения от Вашего оператора. Этот шаг является обязательным для Вашего оператора.
zh: 请输入运营商提供给您的确认码。这是您的运营商要求的步骤。

source: Profile Type
es: Tipo de perfil
ru: Тип профиля
zh: 配置文件类型

# service_provider_name
source: Provider
es: Proveedor
ru: Провайдер
zh: 服务提供商

source: SIM card
es: Tarjeta SIM
ru: SIM-карта
zh: SIM卡

# sim_tips
source: Prompt
es: Aviso
ru: Подсказка
zh: 提示

# sim_insert_content
source: SIM card detected inserted into phone
es: Se ha detectado la inserción de la tarjeta SIM en el teléfono
ru: Обнаружена вставленная SIM-карта в телефон
zh: 已检测到SIM卡插入手机

# sim_unplugged
source: SIM card removed!
es: ¡Tarjeta SIM retirada!
ru: SIM-карта извлечена!
zh: sim卡被拔出！

# ble_data_len_size_set
source: Bluetooth data length size setting
es: Datos bluetooth longitud tamaño configuración
ru: Настройка размера длины данных Bluetooth
zh: 蓝牙数据长度大小设置

# ble_size_set_remind
source: Once you do that, you need to restart your Bluetooth device. If the configuration is incorrect, it will cause the device to fail to connect, so use caution!
es: Una vez que lo hagas, debes reiniciar tu dispositivo Bluetooth. Si la configuración es incorrecta, hará que el dispositivo no se conecte, así que tenga cuidado.
ru: Как только вы это сделаете, вам нужно будет перезагрузить устройство Bluetooth. Если конфигурация неправильная, устройство не сможет подключиться, поэтому будьте осторожны.
zh: 执行该操作后，需要重启蓝牙设备。如果配置错误，会导致连接设备失败，请谨慎操作!

# device_connect_timeout
source: Connection timeout, please note that the bluetooth data length is set correctly in the Settings.
es: Se agota el tiempo de espera de la conexión, preste atención a si el tamaño de la longitud de los datos Bluetooth en la configuración está configurado correctamente.
ru: Время ожидания соединения истекает, обратите внимание на то, правильно ли установлен размер длины данных Bluetooth в настройках.
zh: 连接超时，请注意设置中的蓝牙数据长度大小设置是否正确

# copyright
source: COPYRIGHT 2024 LINKS FIELD NETWORKS. ALL RIGHTS RESERVED.
es: Copyright 2022 Enlaces Redes de campo. RESERVADOS TODOS LOS DERECHOS.
